Revit 2024 API
PrinterResolution Enumeration
 Controls the resolution level in rendering settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public enum PrinterResolution
Visual Basic
Public Enumeration PrinterResolution
Visual C++
public enum class PrinterResolution
Members
Member name | Description
Low |  Low printer resolution.
Medium |  Medium printer resolution.
High |  High printer resolution.
VeryHigh |  VeryHigh printer resolution.
Remarks
 It is applicable only when using printer resolution. The suitable resolution value for each resolution level is decided by default in Revit.
See Also
Autodesk.Revit.DB Namespace